#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fastly_service_v1.origami_imageset_data will be created
  + resource "fastly_service_v1" "origami_imageset_data" {
      + activate       = true
      + active_version = (known after apply)
      + cloned_version = (known after apply)
      + comment        = "Managed by Terraform"
      + default_host   = (known after apply)
      + default_ttl    = 3600
      + id             = (known after apply)
      + name           = "Origami Imageset Data (github.com/Financial-Times/origami-imageset-data)"

      + backend {
          + address               = "origami-imageset-data-eu.s3.amazonaws.com"
          + auto_loadbalance      = false
          + between_bytes_timeout = 10000
          + connect_timeout       = 1000
          + error_threshold       = 0
          + first_byte_timeout    = 15000
          + healthcheck           = "origin_eu_healthcheck"
          + max_conn              = 200
          + name                  = "origin_eu"
          + port                  = 443
          + ssl_cert_hostname     = "*.s3.amazonaws.com"
          + ssl_check_cert        = true
          + use_ssl               = false
          + weight                = 100
        }
      + backend {
          + address               = "origami-imageset-data-us.s3.amazonaws.com"
          + auto_loadbalance      = false
          + between_bytes_timeout = 10000
          + connect_timeout       = 1000
          + error_threshold       = 0
          + first_byte_timeout    = 15000
          + healthcheck           = "origin_us_healthcheck"
          + max_conn              = 200
          + name                  = "origin_us"
          + port                  = 443
          + ssl_cert_hostname     = "*.s3.amazonaws.com"
          + ssl_check_cert        = true
          + use_ssl               = false
          + weight                = 100
        }

      + domain {
          + name = "origami-images.ft.com"
        }

      + gzip {
          + content_types = [
              + "application/javascript",
              + "application/json",
              + "application/vnd.ms-fontobject",
              + "application/x-font-opentype",
              + "application/x-font-truetype",
              + "application/x-font-ttf",
              + "application/x-javascript",
              + "application/xml",
              + "font/eot",
              + "font/opentype",
              + "font/otf",
              + "image/svg+xml",
              + "image/vnd.microsoft.icon",
              + "text/css",
              + "text/html",
              + "text/javascript",
              + "text/plain",
              + "text/xml",
            ]
          + extensions    = [
              + "css",
              + "eot",
              + "html",
              + "ico",
              + "js",
              + "json",
              + "otf",
              + "svg",
              + "ttf",
            ]
          + name          = "Compression Policy"
        }

      + healthcheck {
          + check_interval    = 60000
          + expected_response = 200
          + host              = "origami-imageset-data-eu.s3.amazonaws.com"
          + http_version      = "1.1"
          + initial           = 2
          + method            = "HEAD"
          + name              = "origin_eu_healthcheck"
          + path              = "/__gtg"
          + threshold         = 3
          + timeout           = 500
          + window            = 5
        }
      + healthcheck {
          + check_interval    = 60000
          + expected_response = 200
          + host              = "origami-imageset-data-us.s3.amazonaws.com"
          + http_version      = "1.1"
          + initial           = 2
          + method            = "HEAD"
          + name              = "origin_us_healthcheck"
          + path              = "/__gtg"
          + threshold         = 3
          + timeout           = 500
          + window            = 5
        }

      + vcl {
          + content = <<-EOT
                #
                # Multi-region routing to serve requests from the nearest backend.
                #
                
                sub vcl_recv {
                	if (geoip.continent_code ~ "(NA|SA|OC|AS)") {
                		set req.backend = F_origin_us;
                    set req.http.host = "origami-imageset-data-us.s3.amazonaws.com";
                
                		if (!req.backend.healthy) {
                			set req.backend = F_origin_eu;
                      set req.http.host = "origami-imageset-data-eu.s3.amazonaws.com";
                		}
                	} else {
                		set req.backend = F_origin_eu;
                    set req.http.host = "origami-imageset-data-eu.s3.amazonaws.com";
                
                		if (!req.backend.healthy) {
                			set req.backend = F_origin_us;
                      set req.http.host = "origami-imageset-data-us.s3.amazonaws.com";
                		}
                	}
                }
            EOT
          + main    = false
          + name    = "multi-region-routing.vcl"
        }
      + vcl {
          + content = <<-EOT
                #
                # NOTE: The order of these includes is extremely important.
                #
                
                // The Fastly VCL boilerplate.
                include "fastly-boilerplate.vcl";
                
                sub vcl_recv {
                  // Sort query parameters for a better cache hit rate.
                  set req.url = boltsort.sort(req.url);
                }
                
                sub vcl_deliver {
                  if (req.http.Fastly-Debug) {
                    set resp.http.Debug-Backend = req.backend;
                    set resp.http.Debug-Cache-State = fastly_info.state;
                    set resp.http.Debug-Request-Header-True-Client-IP = req.http.True-Client-IP;
                    set resp.http.Debug-Request-Header-User-Agent = req.http.User-Agent;
                    set resp.http.Debug-Request-Header-X-Forwarded-For = req.http.X-Forwarded-For;
                    set resp.http.Debug-Request-Id = req.http.X-Request-Id;
                    set resp.http.Debug-Request-Restarts = req.restarts;
                    set resp.http.Debug-Response-Header-Surrogate-Control = resp.http.Surrogate-Control;
                    set resp.http.Debug-Url = req.url;
                  } else {
                    unset resp.http.Server;
                    unset resp.http.Via;
                    unset resp.http.X-Api;
                    unset resp.http.X-Cache-Hits;
                    unset resp.http.X-Cache-Policy;
                    unset resp.http.X-Cache;
                    unset resp.http.X-Powered-By;
                    unset resp.http.X-Served-By;
                    unset resp.http.X-StructureId;
                    unset resp.http.X-StructureVersion;
                    unset resp.http.X-Timer;
                  }
                }
                
                // Route requests to the nearest backend.
                include "multi-region-routing.vcl";
            EOT
          + main    = true
          + name    = "main.vcl"
        }
      + vcl {
          + content = <<-EOT
                
                sub vcl_recv {
                  // Give every request a unique ID.
                  set req.http.X-Request-Id = digest.hash_sha256(now randomstr(64) req.http.host req.url req.http.Fastly-Client-IP server.identity);
                
                  // Avoid passing stale objects from Fastly shields to edge POPs.
                  if (req.http.Fastly-FF) {
                    set req.max_stale_while_revalidate = 0s;
                  }
                
                #FASTLY recv
                
                  if (req.request == "FASTLYPURGE") {
                    set req.http.Fastly-Purge-Requires-Auth = "1";
                  }
                
                  if (req.request != "HEAD" && req.request != "GET" && req.request != "FASTLYPURGE") {
                    return(pass);
                  }
                }
                
                sub vcl_fetch {
                  // Serve stale objects on a backend error.
                  if (http_status_matches(beresp.status, "500,502,503,504")) {
                    if (stale.exists) {
                      return(deliver_stale);
                    }
                
                    if (req.restarts < 1 && (req.request == "GET" || req.request == "HEAD")) {
                      restart;
                    }
                
                    error 503;
                  }
                
                #FASTLY fetch
                
                  if (http_status_matches(beresp.status, "500,502,503,504") && req.restarts < 1 && (req.request == "GET" || req.request == "HEAD")) {
                    restart;
                  }
                
                  if (req.restarts > 0) {
                    set beresp.http.Fastly-Restarts = req.restarts;
                  }
                
                  if (beresp.http.Set-Cookie) {
                    set req.http.Fastly-Cachetype = "SETCOOKIE";
                  }
                
                  if (beresp.http.Cache-Control ~ "private") {
                    set req.http.Fastly-Cachetype = "PRIVATE";
                  }
                }
                
                sub vcl_hit {
                #FASTLY hit
                
                  if (!obj.cacheable) {
                    return(pass);
                  }
                }
                
                sub vcl_miss {
                #FASTLY miss
                }
                
                sub vcl_deliver {
                  // Serve stale objects on a backend error.
                  if (http_status_matches(resp.status, "500,502,503,504") && stale.exists) {
                    restart;
                  }
                
                #FASTLY deliver
                }
                
                sub vcl_error {
                #FASTLY error
                
                  if (http_status_matches(obj.status, "500,502,503,504") && stale.exists) {
                    return(deliver_stale);
                  }
                }
                
                sub vcl_pass {
                #FASTLY pass
                }
                
                sub vcl_log {
                #FASTLY log
                }
            EOT
          + main    = false
          + name    = "fastly-boilerplate.vcl"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @JakeChampion, Action: `pull_request`, Working Directory: `terraform/`, Workflow: `Test`*